sample/ptz/SendAuxiliaryCommand.req.xml

<?xml version="1.0" encoding="utf-8"?>
<Envelope xmlns="http://www.w3.org/2003/05/soap-envelope" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tt="http://www.onvif.org/ver10/schema" xmlns:tptz="http://www.onvif.org/ver20/ptz/wsdl">
  <Body>
    <tptz:SendAuxiliaryCommand>
      <tptz:ProfileToken>Profile_1</tptz:ProfileToken>
      <tt:AuxiliaryData>tt:IRLamp|Off</tt:AuxiliaryData>
    </tptz:SendAuxiliaryCommand>
  </Body>
</Envelope>
